BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
#include <Arduino.h>
//#include <string.h>
#include <time.h>

#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>

#include <datalogger_config.h>  //Configuration parameters.

#include <Hash.h>
#include <WebServerFiles.cpp>

#include <FS.h>           //SPIFFS libraries.
#include <user_interface.h>   //Functions to handle RTC memory.
#include <rtc_memory.hpp>


//----------------------------------------------------------------------------------------
DHT dht22_sensor_1(DHT_SENSOR_1_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_2(DHT_SENSOR_2_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_3(DHT_SENSOR_3_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_4(DHT_SENSOR_4_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object

//---------------------------------------------------------------------------------------------------------------------
//Initialization functions.
void portInit(void);
uint8_t getBatteryLevel(void);           //Get battery level percentage (0 to 100%).
void setBatteryState(uint8 state=ON);     //Connects or disconnects battery.
void SetSensorPower(unsigned char state);
void wifiTurnOn(void);
void wifiTurnOff(void);
void goDeepSleep(uint64_t time);

void* stringToArray(std::string origin_string);
int32_t generateMeasurementValue(unsigned char type, float value);
String formatMeasurementValue(unsigned char type, float value);  //Converts measurements into valid format

bool writeDataToFlash(String path, void* data, unsigned int bytes);
bool readDataFromFlash(String path, uint32_t index, void* data, unsigned int bytes);
bool archiveWrite(void* data, uint16_t bytes);
bool archiveRead(uint32_t start_index, uint32_t end_index);
uint32_t archiveGetPointer(void);
//Functions to handle 
void handleHome(void);
void handleChangeNetworkConfig(void);
void handleChangeServerConfig(void);
unsigned char runWebServer(void);
unsigned char handleFormatRam(void);
unsigned char handleFormatFlash(void);
//---------------------------------------------------------------------------------------------------------------------

ESP8266WiFiMulti WiFiMulti;
ESP8266WebServer server(8080);

RtcMemory rtcmem;


void setup() {
  portInit();
  wifiTurnOff();
  Serial.begin(115200);


  delay(200);
  
  if (digitalRead(14))    //
  {
    digitalWrite(15,HIGH);
    getBatteryLevel();
   
  }
  else
  {
    digitalWrite(15,LOW);
  }

  SPIFFS.begin();
  
  runWebServer();

  handleFormatFlash();  //FOR TESTING ONLY!
  handleFormatRam();


//////////////////////////////////////////////////////////////

/* 
  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  SetSensorPower(ON);
  delay(1000);
  //GET MEASUREMENTS
  for (unsigned char i = 0; i<4 ; i++){
    Serial.printf("\nTemperature_%d: %f\n", i+1, temperature_float[i] );
    Serial.printf("Humidity_%d: %f\n", i+1,humidity_float[i] );
  } 
  SetSensorPower(OFF);
*/

  // DEBUG: Write arbitrary data to  RTC memory.
      //Get measurements...
    measurement m;    
    m.timestamp=1234567890+millis(); //Put current timestamp
    m.id_sensor[0]=1;   
    m.id_sensor[1]=2; 
    m.id_sensor[2]=3; 
    m.id_sensor[3]=4;
    m.temperature[0]=190; 
    m.temperature[1]=195;
    m.temperature[2]=195;
    m.temperature[3]=192;
    m.humidity[0]=56; 
    m.humidity[1]=54; 
    m.humidity[2]=54; 
    m.humidity[3]=52; 
    
    //Save measurements into temporary memory.
    if ( ! rtcmem.saveMeasurements(&m, sizeof(m))) //If data is not saved correctly in RAM...
    {
      Serial.printf(" \n -------- RTC memory full. Saving data to flash and clearing memory... --------");
      /* save to flash, clear RAM and then rewrite to it */
      
      uint8 buf[(RTC_MEMORY_MEASUREMENTS_END_BLOCK - RTC_MEMORY_MEASUREMENTS_START_BLOCK)*4];   //Temporary buffer to read measurements
      rtcmem.readData(RTC_MEMORY_MEASUREMENTS_START_BLOCK, &buf, (RTC_MEMORY_MEASUREMENTS_END_BLOCK - RTC_MEMORY_MEASUREMENTS_START_BLOCK)*4);

      // writeDataToFlash(MEASUREMENTS_FILE_NAME, buf, sizeof(buf)); //Save measurements to flash.
      archiveWrite(buf, sizeof(buf));
      rtcmem.clearMeasurements();   //Clears rtc memory.

      m.timestamp=millis();   //Put actual time for the moment the pending to store measurement is stored.
      rtcmem.saveMeasurements(&m, sizeof(m));   //Saves current measurement.
  

    }

  
  
  
}

void loop() {

  server.handleClient(); //Handling of incoming requests
  //Waits for WiFi connection
/*   if ((WiFiMulti.run() == WL_CONNECTED)) {
    Serial.printf("WiFi Connected!");
    
    WiFiClient client;
    HTTPClient http;
  
    Serial.print("[HTTP] begin...\n");
    if (http.begin(client, "http://192.168.0.172:8080/sendmeasurements")) {  // HTTP
      String request;

      
      //Send POST request
      Serial.print("[HTTP] POST...:\n");
      Serial.print(request);
      int httpCode = http.POST( request );
      //int httpCode = http.GET();

      // httpCode will be negative on error
      if (httpCode > 0) {
        // HTTP header has been send and Server response header has been handled
        Serial.printf("[HTTP] POST... code: %d\n", httpCode);
        
        // file found at server
        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
          String payload = http.getString();
          Serial.println(payload);
        }

        goDeepSleep(60e6);  //Deep sleep for low power consumption.

      } else {
        Serial.printf("[HTTP] GET failed, error: %s\n", http.errorToString(httpCode).c_str());
        goDeepSleep(60e6);
      }
      http.end();
    } 
    else {
      Serial.printf("[HTTP] Unable to connect\n");
      goDeepSleep(60e6);  //Deep sleep for low power consumption.
    }
  } 
*/

/* 
  measurement m;
  m.timestamp=1234567890; //Put current timestamp
  m.id_sensor[0]=1;   
  m.id_sensor[1]=2; 
  m.id_sensor[2]=3; 
  m.id_sensor[3]=4;
  m.temperature[0]=generateMeasurementValue(TEMPERATURE, dht22_sensor_1.readTemperature()); 
  m.temperature[1]=generateMeasurementValue(TEMPERATURE, dht22_sensor_2.readTemperature());
  m.temperature[2]=generateMeasurementValue(TEMPERATURE, dht22_sensor_3.readTemperature());
  m.temperature[3]=generateMeasurementValue(TEMPERATURE, dht22_sensor_4.readTemperature());
  m.humidity[0]=generateMeasurementValue(HUMIDITY, dht22_sensor_1.readHumidity()); 
  m.humidity[1]=generateMeasurementValue(HUMIDITY, dht22_sensor_2.readHumidity()); 
  m.humidity[2]=generateMeasurementValue(HUMIDITY, dht22_sensor_3.readHumidity()); 
  m.humidity[3]=generateMeasurementValue(HUMIDITY, dht22_sensor_4.readHumidity());  
  saveMeasurements(&m, sizeof(m)); 
*/
  

 
  



  
